[
    {
        "id": "gyokeres-to-arsenal",
        "section": "sports",
        "image": "/images/gyo.jpg",
        "title": "54-goal man Gyokeres sends hint to Arsenal, Man Utd, Chelsea with 3-word message",
        "content": "Viktor Gyokeres has added fuel to the rumors about a potential move to Arsenal this summer with some fresh comments after his latest heroics for Sporting Lisbon. The 26-year-old Swedish striker scored a crucial stoppage-time penalty to help Sporting come from behind to beat rivals Benfica in the Taça de Portugal final, in what could be a fitting farewell. That goal took his tally to an impressive 54 goals and 13 assists in 51 games this season, making him an obvious target for Arsenal, who’ve struggled to find the net consistently. Mikel Arteta’s side has been linked with Gyokeres since his time at Coventry City, and they’re reportedly among the top clubs in the race to sign the £60m-rated forward. When asked about his future after the Benfica match, Gyokeres said; “Let us see. It’s hard for me to say, because it is football and you never know what’s going to happen in the summer,” he told reporters. “So, for me to say anything else [other] than that is impossible. ”Pressed specifically about a possible move to Arsenal, he stayed focused on the present. “I don’t know, I just focus on this,” he said. “I’ve tried to focus on the last games because it’s so important and I don’t want to think about anything else. So yeah, if anything is true, let’s see in the summer.”"
    },
    {
        "id": "victor-oshimen-out",
        "section": "Sports",
        "image": "/images/osi.jpg",
        "title": "Osimhen out Gyokeres in - Juventus drop Super Eagles star chase, set to hijack Arsenal deal for Swedish forward",
        "content": "The Bianconeri have shifted their primary target after Victor Osimhen reportedly prefers a move to Saudi Arabia. Instead of the Nigerian striker, currently on loan at Galatasaray from Napoli, 'The Old Lady' has reportedly set their sights on Viktor Gyokeres, who is also being pursued by Arsenal. A summer revolution is brewing at Juventus, both on the bench, where Igor Tudor might refuse to stay for the Club World Cup if he isn't confirmed as head coach soon, and within the playing squad. The priority in the transfer market appears to be finding a solution at striker, a position that proved problematic last season. "
    },
    {
        "id": "history-maker-oshimen",
        "section": "sports",
        "image": "/images/osimen.jpg",
        "title": "HISTORY MAKER! Osimhen becomes 2nd African to hit 25-goal mark in Turkish Super Lig history",
        "content": "Victor Osimhen makes history as the second African to score 25+ goals in a Turkish Süper Lig season, winning the golden boot and leading Galatasaray to their 25th league title. Nigeria’s Victor Osimhen has engraved his name in Turkish Super Lig history by becoming the second African player to score more than 25 goals in a single season, securing the league’s golden boot after an outstanding campaign on loan from SSC Napoli. Osimhen’s remarkable achievement places him alongside Senegalese striker Mbaye Diagne, who first reached this milestone during the 2018/2019 season by netting 30 goals in 29 matches for Kasimpasa and Galatasaray. The 26-year-old Nigerian forward scored 26 goals in 30 league appearances for Galatasaray this season, playing a pivotal role in leading the Lions to their record 25th league title. By reaching this landmark, Osimhen also became the third African player to win the Süper Lig golden boot, joining Morocco’s Aatif Chahechouche and Mbaye Diagne in this elite group."
    },
    {
        "id": "nigeria-vs-jamaica",
        "section": "sports",
        "image": "/images/nigeriaJam.jpg",
        "title": "Nigeria vs Jamaica: Super Eagles fail Reggae Boyz test, lift Unity Cup on penalties",
        "content": "The Super Eagles of Nigeria and Jamaica’s Reggae Boyz delivered an exhilarating final in the 2025 Unity Cup, ending regular time in a 2-2 stalemate before Nigeria won 5-4 in a tense penalty shootout at Brentford Stadium, London. The match was a bag of emotions as Nigeria twice took the lead. Captain Moses Simon opened the scoring with a well-placed finish, assisted by Cyriel Dessers."
    },
  {
    "id": "dtigers-qualify-afrobasket-2025",
    "section": "sports",
    "image": "https://guardian.ng/wp-content/uploads/2025/02/dtigers.jpg",
    "title": "D’Tigers Qualify for 2025 AfroBasket Tournament",
    "content": "Nigeria's men's basketball team, D’Tigers, secured their spot in the 2025 AfroBasket after a commanding 77–62 victory over Cape Verde. The team showcased resilience, bouncing back from early losses to finish strong in the qualifiers. Caleb Agada led the charge with 23 points and six assists, while Kaodirichi Akobundu-Ehiogu dominated the boards with nine rebounds."
  },
  {
    "id": "ogoh-odaudu-bal-draw",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Ogoh_Odaudu.jpg/800px-Ogoh_Odaudu.jpg",
    "title": "Ogoh Odaudu Discusses Tough BAL Draw",
    "content": "Coach Ogoh Odaudu acknowledges the challenging Basketball Africa League draw for Rivers Hoopers. Despite the tough competition, Odaudu remains optimistic about his team's chances, emphasizing preparation and teamwork as key factors for success in the upcoming games."
  },
  {
    "id": "thunder-nba-finals-prospects",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Oklahoma_City_Thunder_logo.svg/800px-Oklahoma_City_Thunder_logo.svg.png",
    "title": "NBA Finals Outlook: Thunder's Prospects",
    "content": "The Oklahoma City Thunder's path to the NBA Finals is analyzed amid their current form. With a blend of young talent and experienced players, the Thunder are poised to make a deep playoff run, provided they maintain consistency and capitalize on their strengths."
  },
   {
    "id": "tragic-bus-accident-kano-athletes",
    "section": "sports",
    "image": "https://apnews.com/images/2025/06/01/kano_bus_accident.jpg",
    "title": "Tragic Bus Accident Claims Lives of 22 Athletes in Kano",
    "content": "A devastating road accident in Nigeria's Kano state resulted in the deaths of at least 22 athletes returning from the National Sports Festival in Ogun State. The bus veered off the Chiromawa Bridge on the Kano-Zaria expressway. Survivors are receiving treatment, and the state has declared a day of mourning."
  },
  {
    "id": "cyriel-dessers-boosts-market-value",
    "section": "sports",
    "image": "https://www.thescottishsun.co.uk/wp-content/uploads/2025/05/cyriel_dessers_goal.jpg",
    "title": "Cyriel Dessers Increases Market Value with Goal for Nigeria",
    "content": "Rangers striker Cyriel Dessers enhanced his market value by scoring in Nigeria's 2-1 Unity Cup win over Ghana. Fans estimate his value has risen by £1.5 million, making him a potential transfer target amid new ownership at Ibrox."
  },
  {
    "id": "sunday-oliseh-appointed-ifab-panel",
    "section": "sports",
    "image": "https://timesofindia.indiatimes.com/photo/121416843.cms",
    "title": "Sunday Oliseh Appointed to IFAB Football Advisory Panel",
    "content": "Nigerian football legend Sunday Oliseh has been appointed to the Football Advisory Panel of the International Football Association Board (IFAB), recognizing his contributions to the sport and allowing him to influence future football regulations."
  },
  {
    "id": "liverpool-bid-wirtz-sign-frimpong",
    "section": "sports",
    "image": "https://www.theguardian.com/incoming/article123456.ece/ALTERNATES/s615/jeremie_frimpong.jpg",
    "title": "Liverpool Bid £109m for Wirtz and Sign Frimpong",
    "content": "Liverpool has made a record £109 million bid for Bayer Leverkusen's Florian Wirtz and finalized a £29.5 million deal for Jeremie Frimpong, aiming to strengthen their squad ahead of the Champions League final."
  },
  {
    "id": "nigeria-first-skatepark-lagos",
    "section": "sports",
    "image": "https://as.com/deportes_accion/urbano/images/2025/05/30/nigeria_skatepark.jpg",
    "title": "Nigeria's First Skatepark Opens in Lagos",
    "content": "BMX rider Courage Adams led the construction of Nigeria's first skatepark in Lagos, overcoming logistical challenges to provide a new venue for local riders and promote the sport's growth in the country."
  },
  {
    "id": "nigeria-rugby-league-talent-scouting",
    "section": "sports",
    "image": "https://www.thescottishsun.co.uk/wp-content/uploads/2025/05/nigeria_rugby_league.jpg",
    "title": "Nigeria's Rugby League Potential Attracts International Attention",
    "content": "Super League clubs are encouraged to scout talent from Africa, particularly Nigeria, due to the country's growing rugby scene and the presence of skilled players both locally and in the UK."
  },
  {
    "id": "matthew-kuti-african-cup-debut",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Matthew_Kuti.jpg/800px-Matthew_Kuti.jpg",
    "title": "Matthew Kuti Set for African Cup Debut in Tunisia",
    "content": "Nigerian table tennis player Matthew Kuti is poised to make his African Cup debut in Tunisia, aiming to qualify for the 2025 ITTF World Cup in Macao after reclaiming the national title."
  },
  {
    "id": "kwibuka-womens-t20-tournament-2025",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Kwibuka_T20_2025.jpg/800px-Kwibuka_T20_2025.jpg",
    "title": "2025 Kwibuka Women's T20 Tournament Set to Begin in Rwanda",
    "content": "The 2025 Kwibuka Women's T20 Tournament will take place in Rwanda from June 3–14, featuring nine teams, including Nigeria, in a competition that commemorates the 1994 genocide against the Tutsi."
  },
  {
    "id": "sffl-showtime-flag-football-league",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/SFFL_Showtime.jpg/800px-SFFL_Showtime.jpg",
    "title": "SFFL Showtime: Nigeria's Premier Coed Flag Football League",
    "content": "The Showtime Flag Football League, Nigeria's largest co-ed professional flag football league, continues to grow, promoting inclusivity and competitive play with plans for national expansion and youth development programs."
  },
  {
    "id": "womens-afrobasket-2025-preview",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Womens_AfroBasket_2025.jpg/800px-Womens_AfroBasket_2025.jpg",
    "title": "Nigeria's D'Tigress Aim for Fifth Consecutive AfroBasket Title",
    "content": "Nigeria's women's basketball team, D'Tigress, seeks a fifth consecutive AfroBasket title at the 2025 tournament in Ivory Coast, building on their historic quarter-final finish at the Paris 2024 Olympics."
  },
  {
    "id": "elsa-vadfors-rising-star",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Elsa_Vadfors.jpg/800px-Elsa_Vadfors.jpg",
    "title": "Elsa Vadfors Shines in Women's Basketball",
    "content": "Elsa Vadfors is highlighted as a rising star in women's basketball with promising potential. Her recent performances have caught the attention of scouts and fans alike, marking her as one to watch in upcoming tournaments."
  },
  {
    "id": "otega-oweh-returns-kentucky",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Otega_Oweh.jpg/800px-Otega_Oweh.jpg",
    "title": "Otega Oweh Returns to Kentucky",
    "content": "Otega Oweh announces his return to the University of Kentucky, bolstering their basketball roster. His decision adds depth and experience to the team, aiming to enhance their competitiveness in the upcoming season."
  },
  {
    "id": "man-united-signs-matheus-cunha",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Matheus_Cunha.jpg/800px-Matheus_Cunha.jpg",
    "title": "Manchester United Signs Matheus Cunha",
    "content": "Manchester United confirms the acquisition of Matheus Cunha for £62.5 million. The Brazilian forward is expected to add firepower to United's attack, bringing versatility and creativity to the front line."
  },
  {
    "id": "liverpool-kerkez-kelleher-transfer",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Milos_Kerkez.jpg/800px-Milos_Kerkez.jpg",
    "title": "Liverpool Bids for Kerkez; Kelleher Nears Exit",
    "content": "Liverpool submits a bid for Milos Kerkez as goalkeeper Caoimhin Kelleher is close to leaving the club. The Reds aim to strengthen their defense with Kerkez's addition, while Kelleher seeks more playing time elsewhere."
  },
  {
    "id": "trent-alexander-arnold-real-madrid",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Trent_Alexander-Arnold.jpg/800px-Trent_Alexander-Arnold.jpg",
    "title": "Trent Alexander-Arnold Joins Real Madrid",
    "content": "Trent Alexander-Arnold is officially announced as a new Real Madrid player. The English right-back's move marks a significant addition to Madrid's defense, bringing in his renowned crossing ability and tactical awareness."
  },
  {
    "id": "bruno-fernandes-al-hilal-target",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Bruno_Fernandes.jpg/800px-Bruno_Fernandes.jpg",
    "title": "Bruno Fernandes Targeted by Al Hilal",
    "content": "Bruno Fernandes is considering a move to Saudi Arabia, with Al Hilal making him a top target. The Portuguese midfielder's potential transfer could be one of the most high-profile moves to the Saudi Pro League."
  },
  {
    "id": "psg-champions-league-victory",
    "section": "sports",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/PSG_celebration.jpg/800px-PSG_celebration.jpg",
    "title": "PSG Wins Champions League with 5-0 Victory",
    "content": "Paris Saint-Germain clinches the Champions League title after a dominant 5-0 win over Inter Milan. The victory marks PSG's first-ever Champions League triumph, highlighted by standout performances from Desire Doue and Achraf Hakimi."
  }
]
